<div class="divFeedBack">
    <p>Благодарю за интересные задачи! Хочу пояснить, что при выполнении я принял решение немного расширить задачи таким образом, что основная задача является частным случаем, а именно:</p>
    <p> Для задачи 1 можно сформировать матрицу размерностью от 2х2 до 9х9, а вычислить сумму элементов не только побочной, но и главной диагонали. </p>
    <p> Для задачи 3 можно расшифровать не только заданную в условии строку, но и любую другую, соответствующую данному алгоритму шифрования. </p>
    <p> Также, применил технологию MVC и немного украсил вёрстку с помощью CSS.</p>
    <p>P.S. Возможно неверно понял задачу 2. Если  картинки схемы недостаточно, дайте знать.</p>
</div>