<div class="Condition_task">
    <p>Дан шифр ->11гe+20∆∆A+4µcњil->5•Ћ®†Ѓ p+5f-7Ќ¬f pro+10g+1悦ra->58->44m+1*m+2a喜er!
        Правила его расшифровки следующие:</br>
        - Начинать чтение нужно с крайнего левого символа и двигаться вправо.</br>
        - Если вы сталкиваетесь с любым символом, кроме специальных обозначений, то данный символ без изменений попадает в результирующую строчку.</br>
        - Специальными обозначениями являются "->", "+", "-". После специального обозначения всегда идет число, являющееся аргументом.</br>
        - "->" — вам необходимо перейти к символу с номером, записанном в аргументе (счет начинается с 0).</br>
        - "+" — пропустить столько символов, сколько записано в аргументе. Отсчет начинается после аргумента.</br>
        - "-" — аналогично, но перемещение происходит назад (влево)</br></p>

        <p>Программа должна быть написана на PHP. Ответом является строчка.</p>

</div>
</br>
